apache/nuttx/arch/arm/src/stm32h5/hardware/stm32h5_tim.h
/****************************************************************************
 * arch/arm/src/stm32h5/hardware/stm32h5_tim.h
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

#ifndef __ARCH_ARM_SRC_STM32H5_HARDWARE_STM32_TIM_H
#define __ARCH_ARM_SRC_STM32H5_HARDWARE_STM32_TIM_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>
#include "chip.h"

/****************************************************************************
 * Pre-porcessor Definitions
 ****************************************************************************/

/* The STM32H5 family uses STM32 TIMER IP version 2 */

#define HAVE_IP_TIMERS_V2 1

/* Register Offsets *********************************************************/

/* Basic Timers - TIM6 and TIM7 */

#define STM32_BTIM_CR1_OFFSET   0x0000
#define STM32_BTIM_CR2_OFFSET   0x0004
#define STM32_BTIM_DIER_OFFSET  0x000c
#define STM32_BTIM_SR_OFFSET    0x0010
#define STM32_BTIM_EGR_OFFSET   0x0014
#define STM32_BTIM_CNT_OFFSET   0x0024
#define STM32_BTIM_PSC_OFFSET   0x0028
#define STM32_BTIM_ARR_OFFSET   0x002c

/* Advanced Timers - TIM1 and TIM8 */

#define STM32_ATIM_CR1_OFFSET      0x0000  /* Control register 1 */
#define STM32_ATIM_CR2_OFFSET      0x0004  /* Control register 2 */
#define STM32_ATIM_SMCR_OFFSET     0x0008  /* Slave mode control register */
#define STM32_ATIM_DIER_OFFSET     0x000c  /* DMA/Interrupt enable register */
#define STM32_ATIM_SR_OFFSET       0x0010  /* Status register */
#define STM32_ATIM_EGR_OFFSET      0x0014  /* Event generation register */
#define STM32_ATIM_CCMR1_OFFSET    0x0018  /* Capture/compare mode register 1 */
#define STM32_ATIM_CCMR2_OFFSET    0x001c  /* Capture/compare mode register 2 */
#define STM32_ATIM_CCER_OFFSET     0x0020  /* Capture/compare enable register */
#define STM32_ATIM_CNT_OFFSET      0x0024  /* Counter */
#define STM32_ATIM_PSC_OFFSET      0x0028  /* Prescaler */
#define STM32_ATIM_ARR_OFFSET      0x002c  /* Auto-reload register */
#define STM32_ATIM_RCR_OFFSET      0x0030  /* Repetition counter register */
#define STM32_ATIM_CCR1_OFFSET     0x0034  /* Capture/compare register 1 */
#define STM32_ATIM_CCR2_OFFSET     0x0038  /* Capture/compare register 2 */
#define STM32_ATIM_CCR3_OFFSET     0x003c  /* Capture/compare register 3 */
#define STM32_ATIM_CCR4_OFFSET     0x0040  /* Capture/compare register 4 */
#define STM32_ATIM_BDTR_OFFSET     0x0044  /* Break and dead-time register */
#define STM32_ATIM_CCR5_OFFSET     0x0048  /* Capture/compare register 5 */
#define STM32_ATIM_CCR6_OFFSET     0x004c  /* Capture/compare register 6 */
#define STM32_ATIM_CCMR3_OFFSET    0x0050  /* Capture/compare mode register 3 */
#define STM32_ATIM_DTR2_OFFSET     0x0054  /* Deadtime register 2 */
#define STM32_ATIM_ECR_OFFSET      0x0058  /* Encoder control register */
#define STM32_ATIM_TISEL_OFFSET    0x005c  /* Input selection register */
#define STM32_ATIM_AF1_OFFSET      0x0060  /* Alternate function register 1 */
#define STM32_ATIM_AF2_OFFSET      0x0064  /* Alternate function register 2 */
#define STM32_ATIM_DCR_OFFSET      0x03dc  /* DMA control register */
#define STM32_ATIM_DMAR_OFFSET     0x03e0  /* DMA address for full transfer */

/* General Purpose Timers - TIMx x=2-5,12-17 */

#define STM32_GTIM_CR1_OFFSET      0x0000  /* Control register 1 (16-bit) */
#define STM32_GTIM_CR2_OFFSET      0x0004  /* Control register 2 (16-bit, TIM2, 5 only) */
#define STM32_GTIM_SMCR_OFFSET     0x0008  /* Slave mode control register (32-bit, TIM2, 5, 9, 12 only) */
#define STM32_GTIM_DIER_OFFSET     0x000c  /* DMA/Interrupt enable register (16-bit) */
#define STM32_GTIM_SR_OFFSET       0x0010  /* Status register (16-bit) */
#define STM32_GTIM_EGR_OFFSET      0x0014  /* Event generation register (16-bit) */
#define STM32_GTIM_CCMR1_OFFSET    0x0018  /* Capture/compare mode register 1 (32-bit) */
#define STM32_GTIM_CCMR2_OFFSET    0x001c  /* Capture/compare mode register 2 (32-bit on TIM2,5 only) */
#define STM32_GTIM_CCER_OFFSET     0x0020  /* Capture/compare enable register (16-bit) */
#define STM32_GTIM_CNT_OFFSET      0x0024  /* Counter (16 bit and 32-bit on TIM2, 5 only) */
#define STM32_GTIM_PSC_OFFSET      0x0028  /* Prescaler (16-bit) */
#define STM32_GTIM_ARR_OFFSET      0x002c  /* Auto-reload register (16 bit and 32-bit on TIM2, 5 only) */
#define STM32_GTIM_RCR_OFFSET      0x0030
#define STM32_GTIM_CCR1_OFFSET     0x0034  /* Capture/compare register 1 (16-bit on all TIMx and 32-bit on TIM2,5 only) */
#define STM32_GTIM_CCR2_OFFSET     0x0038  /* Capture/compare register 2 (16-bit TIM 3-4, 9, 12 and 32-bit on TIM2,5 only) */
#define STM32_GTIM_CCR3_OFFSET     0x003c  /* Capture/compare register 3 (16-bit TIM 3-4 and 32-bit on TIM2,5 only) */
#define STM32_GTIM_CCR4_OFFSET     0x0040  /* Capture/compare register 4 (16-bit TIM 3-4 and 32-bit on TIM2,5 only) */
#define STM32_GTIM_BDTR_OFFSET     0x0044
#define STM32_GTIM_DTR2_OFFSET     0x0054
#define STM32_GTIM_ECR_OFFSET      0x0058
#define STM32_GTIM_TISEL_OFFSET    0x005c
#define STM32_GTIM_AF1_OFFSET      0x0060
#define STM32_GTIM_AF2_OFFSET      0x0064
#define STM32_GTIM_DCR_OFFSET      0x03dc
#define STM32_GTIM_DMAR_OFFSET     0x03e0

