apache/nuttx/arch/arm/src/stm32h5/hardware/stm32h5_tim.h
#define ATIM_BDTR_OSSI            (1 << 10) /* Bit 10: Off-State Selection for Idle mode */
#define ATIM_BDTR_OSSR            (1 << 11) /* Bit 11: Off-State Selection for Run mode */
#define ATIM_BDTR_BKE             (1 << 12) /* Bit 12: Break enable */
#define ATIM_BDTR_BKP             (1 << 13) /* Bit 13: Break Polarity */
#define ATIM_BDTR_AOE             (1 << 14) /* Bit 14: Automatic Output enable */
#define ATIM_BDTR_MOE             (1 << 15) /* Bit 15: Main Output enable */
#define ATIM_BDTR_BKF_SHIFT       (16)      /* Bits 16-19: Break filter */
#define ATIM_BDTR_BKF_MASK        (0xf << ATIM_BDTR_BKF_SHIFT)
#  define ATIM_BDTR_BKF_NOFILT    (0 << ATIM_BDTR_BKF_SHIFT)   /* 0000: No filter, BRK acts asynchronously */
#  define ATIM_BDTR_BKF_FCKINT2   (1 << ATIM_BDTR_BKF_SHIFT)   /* 0001: fSAMPLING=fCK_INT, N=2 */
#  define ATIM_BDTR_BKF_FCKINT4   (2 << ATIM_BDTR_BKF_SHIFT)   /* 0010: fSAMPLING=fCK_INT, N=4 */
#  define ATIM_BDTR_BKF_FCKINT8   (3 << ATIM_BDTR_BKF_SHIFT)   /* 0011: fSAMPLING=fCK_INT, N=8 */
#  define ATIM_BDTR_BKF_FDTSd26   (4 << ATIM_BDTR_BKF_SHIFT)   /* 0100: fSAMPLING=fDTS/2, N=6 */
#  define ATIM_BDTR_BKF_FDTSd28   (5 << ATIM_BDTR_BKF_SHIFT)   /* 0101: fSAMPLING=fDTS/2, N=8 */
#  define ATIM_BDTR_BKF_FDTSd36   (6 << ATIM_BDTR_BKF_SHIFT)   /* 0110: fSAMPLING=fDTS/4, N=6 */
#  define ATIM_BDTR_BKF_FDTSd38   (7 << ATIM_BDTR_BKF_SHIFT)   /* 0111: fSAMPLING=fDTS/4, N=8 */
#  define ATIM_BDTR_BKF_FDTSd86   (8 << ATIM_BDTR_BKF_SHIFT)   /* 1000: fSAMPLING=fDTS/8, N=6 */
#  define ATIM_BDTR_BKF_FDTSd88   (9 << ATIM_BDTR_BKF_SHIFT)   /* 1001: fSAMPLING=fDTS/8, N=8 */
#  define ATIM_BDTR_BKF_FDTSd165  (10 << ATIM_BDTR_BKF_SHIFT)  /* 1010: fSAMPLING=fDTS/16, N=5 */
#  define ATIM_BDTR_BKF_FDTSd166  (11 << ATIM_BDTR_BKF_SHIFT)  /* 1011: fSAMPLING=fDTS/16, N=6 */
#  define ATIM_BDTR_BKF_FDTSd168  (12 << ATIM_BDTR_BKF_SHIFT)  /* 1100: fSAMPLING=fDTS/16, N=8 */
#  define ATIM_BDTR_BKF_FDTSd325  (13 << ATIM_BDTR_BKF_SHIFT)  /* 1101: fSAMPLING=fDTS/32, N=5 */
#  define ATIM_BDTR_BKF_FDTSd326  (14 << ATIM_BDTR_BKF_SHIFT)  /* 1110: fSAMPLING=fDTS/32, N=6 */
#  define ATIM_BDTR_BKF_FDTSd328  (15 << ATIM_BDTR_BKF_SHIFT)  /* 1111: fSAMPLING=fDTS/32, N=8 */

#define ATIM_BDTR_BK2F_SHIFT      (20)      /* Bits 20-23: Break 2 filter */
#define ATIM_BDTR_BK2F_MASK       (0xf << ATIM_BDTR_BK2F_SHIFT)
#  define ATIM_BDTR_BK2F_NOFILT   (0 << ATIM_BDTR_BK2F_SHIFT)  /* 0000: No filter, BRK 2 acts asynchronously */
#  define ATIM_BDTR_BK2F_FCKINT2  (1 << ATIM_BDTR_BK2F_SHIFT)  /* 0001: fSAMPLING=fCK_INT, N=2 */
#  define ATIM_BDTR_BK2F_FCKINT4  (2 << ATIM_BDTR_BK2F_SHIFT)  /* 0010: fSAMPLING=fCK_INT, N=4 */
#  define ATIM_BDTR_BK2F_FCKINT8  (3 << ATIM_BDTR_BK2F_SHIFT)  /* 0011: fSAMPLING=fCK_INT, N=8 */
#  define ATIM_BDTR_BK2F_FDTSd26  (4 << ATIM_BDTR_BK2F_SHIFT)  /* 0100: fSAMPLING=fDTS/2, N=6 */
#  define ATIM_BDTR_BK2F_FDTSd28  (5 << ATIM_BDTR_BK2F_SHIFT)  /* 0101: fSAMPLING=fDTS/2, N=8 */
#  define ATIM_BDTR_BK2F_FDTSd36  (6 << ATIM_BDTR_BK2F_SHIFT)  /* 0110: fSAMPLING=fDTS/4, N=6 */
#  define ATIM_BDTR_BK2F_FDTSd38  (7 << ATIM_BDTR_BK2F_SHIFT)  /* 0111: fSAMPLING=fDTS/4, N=8 */
#  define ATIM_BDTR_BK2F_FDTSd86  (8 << ATIM_BDTR_BK2F_SHIFT)  /* 1000: fSAMPLING=fDTS/8, N=6 */
#  define ATIM_BDTR_BK2F_FDTSd88  (9 << ATIM_BDTR_BK2F_SHIFT)  /* 1001: fSAMPLING=fDTS/8, N=8 */
#  define ATIM_BDTR_BK2F_FDTSd165 (10 << ATIM_BDTR_BK2F_SHIFT) /* 1010: fSAMPLING=fDTS/16, N=5 */
#  define ATIM_BDTR_BK2F_FDTSd166 (11 << ATIM_BDTR_BK2F_SHIFT) /* 1011: fSAMPLING=fDTS/16, N=6 */
#  define ATIM_BDTR_BK2F_FDTSd168 (12 << ATIM_BDTR_BK2F_SHIFT) /* 1100: fSAMPLING=fDTS/16, N=8 */
#  define ATIM_BDTR_BK2F_FDTSd325 (13 << ATIM_BDTR_BK2F_SHIFT) /* 1101: fSAMPLING=fDTS/32, N=5 */
#  define ATIM_BDTR_BK2F_FDTSd326 (14 << ATIM_BDTR_BK2F_SHIFT) /* 1110: fSAMPLING=fDTS/32, N=6 */
#  define ATIM_BDTR_BK2F_FDTSd328 (15 << ATIM_BDTR_BK2F_SHIFT) /* 1111: fSAMPLING=fDTS/32, N=8 */

#define ATIM_BDTR_BK2E            (1 << 24) /* Bit 24: Break 2 enable */
#define ATIM_BDTR_BK2P            (1 << 25) /* Bit 25: Break 2 polarity */
#define ATIM_BDTR_BKDSRM          (1 << 26) /* Bit 26: Break disarm */
#define ATIM_BDTR_BK2DSRM         (1 << 27) /* Bit 27: Break 2 disarm */
#define ATIM_BDTR_BKBID           (1 << 28) /* Bit 28: Break bidirectional */
#define ATIM_BDTR_BK2BID          (1 << 29) /* Bit 29: Break 2 bidirectional */

/* Deadtime Register 2 */

#define ATIM_DTR2_DTGF_SHIFT      (0)       /* Bits 7:0 : Dead-time falling edge generator setup */
#define ATIM_DTR2_DTGF_MASK       (0xff << ATIM_DTR2_DTGF_SHIFT)
#define ATIM_DTR2_DTAE            (1 << 16) /* Bit 16: Deadtime asymmetric enable */
#define ATIM_DTR2_DTPE            (1 << 17) /* Bit 17: Deadtime preload enable */

/* Encoder Control Register */

#define ATIM_ECR_IE               (1 << 0)  /* Bit 0: Index enable */
#define ATIM_ECR_IDIR_SHIFT       (1)       /* Bits 1-2: Index Direction */
#define ATIM_ECR_IDIR_MASK        (3 << ATIM_ECR_IDIR_SHIFT)
#  define ATIM_ECR_IDIR_ANY       (0 << ATIM_ECR_IDIR_SHIFT)
#  define ATIM_ECR_IDIR_UP        (1 << ATIM_ECR_IDIR_SHIFT)
#  define ATIM_ECR_IDIR_DOWN      (2 << ATIM_ECR_IDIR_SHIFT)

#define ATIM_ECR_IBLK_SHIFT       (3)       /* Bits 3-4: Index blanking */
#define ATIM_ECR_IBLK_MASK        (3 << ATIM_ECR_IBLK_SHIFT)
#define ATIM_ECR_FIDX             (1 << 5)  /* Bit 5: First index */
#define ATIM_ECR_IPOS_SHIFT       (6)       /* Bits 6-7: Index positioning */
#define ATIM_ECR_IPOS_MASK        (3 << ATIM_ECR_IPOS_SHIFT)
#define ATIM_ECR_PW_SHIFT         (16)      /* Bits 16-23: Pulse width */
#define ATIM_ECR_PW_MASK          (0xff << ATIM_ECR_PW_SHIFT)
#define ATIM_ECR_PWPRSC_SHIFT     (24)      /* Bits 24-26: Pulse width prescaler */
#define ATIM_ECR_PWPRSC_MASK      (7 << ATIM_ECR_PWPRSC_SHIFT)

/* Input Selection Register */

#define ATIM_TIXSEL_OFFSET        (8)
#define ATIM_TISEL_TI1SEL_SHIFT   (0)       /* Bits 0-3: Select tim_ti1 input */
#define ATIM_TISEL_TI1SEL_MASK    (0xf << ATIM_TISEL_TI1SEL_SHIFT)
#define ATIM_TISEL_TI2SEL_SHIFT   (8)       /* Bits 8-11: Select tim_ti2 input */
#define ATIM_TISEL_TI2SEL_MASK    (0xf << ATIM_TISEL_TI2SEL_SHIFT)
#define ATIM_TISEL_TI3SEL_SHIFT   (16)      /* bits 16-19: Select tim_ti3 input */
#define ATIM_TISEL_TI3SEL_MASK    (0xf << ATIM_TISEL_TI3SEL_SHIFT)
#define ATIM_TISEL_TI4SEL_SHIFT   (24)      /* Bits 24-27: Select tim_ti4 input */
#define ATIM_TISEL_TI4SEL_MASK    (0xf << ATIM_TISEL_TI4SEL_SHIFT)
#define ATIM_TISEL_TIXSEL(ch, in) ((in) << (ATIM_TIXSEL_OFFSET*((ch) - 1)))

/* Alternate Function Register 1 */

#define ATIM_AF1_BKINE            (1 << 0)  /* TIMx_BKIN input enable */
#define ATIM_AF1_BKCMP1E          (1 << 1)  /* tim_brk_cmp1 enable */
#define ATIM_AF1_BKCMP2E          (1 << 2)  /* tim_brk_cmp2 enable */
#define ATIM_AF1_BKCMP3E          (1 << 3)  /* tim_brk_cmp3 enable */
#define ATIM_AF1_BKCMP4E          (1 << 4)  /* tim_brk_cmp4 enable */
#define ATIM_AF1_BKCMP5E          (1 << 5)  /* tim_brk_cmp5 enable */
#define ATIM_AF1_BKCMP6E          (1 << 6)  /* tim_brk_cmp6 enable */
#define ATIM_AF1_BKCMP7E          (1 << 7)  /* tim_brk_cmp7 enable */
#define ATIM_AF1_BKCMP8E          (1 << 8)  /* tim_brk_cmp8 enable */
#define ATIM_AF1_BKINP            (1 << 9)  /* TIMx_BKIN input polarity */
#define ATIM_AF1_BKCMP1P          (1 << 10) /* tim_brk_cmp1 input polarity */
#define ATIM_AF1_BKCMP2P          (1 << 11) /* tim_brk_cmp2 input polarity */
#define ATIM_AF1_BKCMP3P          (1 << 12) /* tim_brk_cmp3 input polarity */
#define ATIM_AF1_BKCMP4P          (1 << 13) /* tim_brk_cmp4 input polarity */
#define ATIM_AF1_ETRSEL_SHIFT     (14)      /* Bits 14-17: etr_in source selection */
#define ATIM_AF1_ETRSEL_MASK      (0xf << ATIM_AF1_ETRSEL_SHIFT)
#  define ATIM_AF1_ETRSEL(src)    ((src) << ATIM_AF1_ETRSEL_SHIFT) /* etr_in source selection src=0..15*/

